__author__ = 'Сон Чихок'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...
real_number = int(input("Please enter real number : "))
while real_number != 0:
    print(real_number % 10)
    real_number = real_number // 10

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!
number_1 = int(input("Please enter first number : "))
number_2 = int(input("Please enter second number : "))

print("Number_1 =", number_1, "Number_2 =", number_2)
temp = number_2
number_2 = number_1
number_1 = temp
print("Number_1 =", number_1, "Number_2 =", number_2)

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
age = int(input("Сколько лет ? "))
if age >= 18:
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")
