"""
1) Создать программно файл в текстовом формате, записать в него построчно данные, вводимые пользователем. Об окончании
   ввода данных свидетельствует пустая строка.
2) Создать текстовый файл (не программно), сохранить в нем несколько строк, выполнить подсчет количества строк,
   количества слов в каждой строке.
3) Создать текстовый файл (не программно), построчно записать фамилии сотрудников и величину их окладов. Определить,
   кто из сотрудников имеет оклад менее 20 тыс., вывести фамилии этих сотрудников. Выполнить подсчет средней величины
   дохода сотрудников.
4) Создать (не программно) текстовый файл со следующим содержимым:
    One — 1
    Two — 2
    Three — 3
    Four — 4
    Необходимо написать программу, открывающую файл на чтение и считывающую построчно данные. При этом английские
    числительные должны заменяться на русские. Новый блок строк должен записываться в новый текстовый файл.
5) Создать (программно) текстовый файл, записать в него программно набор чисел, разделенных пробелами. Программа должна
   подсчитывать сумму чисел в файле и выводить ее на экран.
6) Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
   практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно
   были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести
   словарь на экран.
7) Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме: название, форма
   собственности, выручка, издержки. Необходимо вычислить прибыль каждой компании и среднюю прибыль. Реализовать список,
   содержащий словарь (название фирмы и прибыль) и словарь с одним элементом (средняя прибыль). Добавить в первый словарь
   еще один элемент, содержащий результат вычисления отношения прибыли к убыткам. Итоговый список сохранить в файл.
   Подсказка: использовать менеджеры контекста.
"""